Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/SYITCL/SYITCL.tmx
Source language: en_us
Languages: de_de

source: 5. The on-board diagnostic apparatus (5) according to any one of claims 1 to 4, wherein the second fault information comprises fault information of a driving assistance category module.
de_de: 5. Borddiagnosevorrichtung (5) nach einem der Ansprüche 1 bis 4, wobei die zweiten Fehlerinformationen Fehlerinformationen eines Fahrassistenzkategoriemoduls umfassen.

source: 6. The on-board diagnostic apparatus (5) according to claim 2 or 3, wherein the third fault information comprises fault information of a driving assistance scenario feature.
de_de: 6. Borddiagnosevorrichtung (5) nach Anspruch 2 oder 3, wobei die dritten Fehlerinformationen Fehlerinformationen eines Fahrassistenzszenariomerkmals umfassen.

source: 7. A vehicle fault diagnostic method, comprising:
de_de: 7. Fahrzeugfehlerdiagnoseverfahren, umfassend:

source: monitoring and recording, by a first diagnostic module (511), first fault information;
de_de: Überwachen und Aufzeichnen von ersten Fehlerinformationen durch ein erstes Diagnosemodul (511);

source: monitoring and recording, by a second diagnostic module (512), second fault information, and sending the second fault information to the first diagnostic module (511);
de_de: Überwachen und Aufzeichnen von zweiten Fehlerinformationen durch ein zweites Diagnosemodul (512) und Senden der zweiten Fehlerinformationen an das erste Diagnosemodul (511);

source: communicating, by the first diagnostic module (511), with a master computer (6) through a first communication interface; and
de_de: Kommunizieren mit einem Master-Computer (6) durch das erste Diagnosemodul (511) über eine erste Kommunikationsschnittstelle; und

source: communicating, by the second diagnostic module (512), with the master computer (6) through a second communication interface;
de_de: Kommunizieren mit dem Master-Computer (6) durch das zweite Diagnosemodul (512) über eine zweite Kommunikationsschnittstelle;

source: the vehicle fault diagnostic method further comprises: repairing, by the first diagnostic module (511), the second diagnostic module (512) by restarting the second diagnostic module (512) or by upgrading software of the second diagnostic module (512) when receiving the second diagnostic module fault information; and
de_de: das Fahrzeugfehlerdiagnoseverfahren ferner Folgendes umfasst: Reparieren, durch das erste Diagnosemodul (511), des zweiten Diagnosemoduls (512) durch Neustarten des zweiten Diagnosemoduls (512) oder durch Aktualisieren von Software des zweiten Diagnosemoduls (512), wenn die Fehlerinformationen des zweiten Diagnosemoduls empfangen werden; und

source: 8. The vehicle fault diagnostic method according to claim 7, further comprising:
de_de: 8. Fahrzeugfehlerdiagnoseverfahren nach Anspruch 7, ferner umfassend:

source: monitoring and recording, by a third diagnostic module (513), third fault information, and sending the third fault information to the second diagnostic module (512); and
de_de: Überwachen und Aufzeichnen von dritten Fehlerinformationen durch ein drittes Diagnosemodul (513) und Senden der dritten Fehlerinformationen an das zweite Diagnosemodul (512); und

source: communicating, by the third diagnostic module (513), with the outside through a third communication interface.
de_de: Kommunizieren mit der Außenseite durch das dritte Diagnosemodul (513) über eine dritte Kommunikationsschnittstelle.

source: 9. The vehicle fault diagnostic method according to claim 8, wherein
de_de: 9. Fahrzeugfehlerdiagnoseverfahren nach Anspruch 8, wobei

source: the vehicle fault diagnostic method further comprises: repairing, by the second diagnostic module (512), the third diagnostic module (513) when receiving the third diagnostic module fault information.
de_de: das Fahrzeugfehlerdiagnoseverfahren ferner Folgendes umfasst: Reparieren, durch das zweite Diagnosemodul (512), des dritten Diagnosemoduls (513), wenn die Fehlerinformationen des dritten Diagnosemoduls empfangen werden.

source: The vehicle fault diagnostic method according to any one of claims 7 to 9, wherein the first fault information comprises fault information of an underlying system.
de_de: Fahrzeugfehlerdiagnoseverfahren nach einem der Ansprüche 7 bis 9, wobei die ersten Fehlerinformationen Fehlerinformationen eines zugrundeliegenden Systems umfassen.

source: The vehicle fault diagnostic method according to any one of claims 7 to 10, wherein the second fault information comprises fault information of a driving assistance category module.
de_de: Fahrzeugfehlerdiagnoseverfahren nach einem der Ansprüche 7 bis 10, wobei die zweiten Fehlerinformationen Fehlerinformationen eines Fahrassistenzkategoriemoduls umfassen.

source: A vehicle, comprising the on-board diagnostic apparatus (5) according to any one of claims 1 to 6.
de_de: Fahrzeug, umfassend die Borddiagnosevorrichtung (5) nach einem der Ansprüche 1 bis 6.

source: A computer-readable storage medium, wherein the computer-readable storage medium stores program instructions, and when the program instructions are run by a computer, the computer is enabled to perform the method according to any one of claims 7 to 11.
de_de: Computerlesbares Speichermedium, wobei das computerlesbare Speichermedium Programmanweisungen speichert, und wenn die Programmanweisungen von einem Computer ausgeführt werden, der Computer in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 7 bis 11 durchzuführen.
